Revit 2027 API
FilteredElementCollector.GetElementCount Method
 Gets the number of elements in your current filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetElementCount()
Public Function GetElementCount As Integer
public:
int GetElementCount()
member GetElementCount : unit -> int
Return Value
Int32
 The number of elements
Remarks
 Does not require a filter, if called on a new FilteredElementCollector it will return a count of all the elements.
See Also
Reference
FilteredElementCollector Class
Autodesk.Revit.DB Namespace